In [1]:
import pandas as pd
import numpy as np

In [2]:
def get_data():
    return [[10, 20], [30, 40], [50, 60], [70, 80]]

def get_data_frame():
    data = [[10, 20], [30, 40], [50, 60], [70, 80]]
    return pd.DataFrame(data)

def get_dict_list():
    return [{'kor': 10, 'eng': 20}, {'kor': 30, 'eng': 40}, 
            {'kor': 50, 'eng': 60}, {'kor': 70, 'eng': 80}]

def get_dict():
    return {"kor": [10, 30, 50, 70], "eng": [20, 40, 60, 80],
           'math': [33, 44, 55, 66]}

def get_dict_data_frame():
    return pd.DataFrame(get_dict(), index=['a', 'b', 'c', 'd'])

In [3]:
# 추가
df = get_dict_data_frame()
df

   kor  eng  math
a   10   20    33
b   30   40    44
c   50   60    55
d   70   80    66

In [4]:
df.index.name='이름'

In [6]:
df.columns.name='과목'

In [7]:
df

과목  kor  eng  math
이름
a    10   20    33
b    30   40    44
c    50   60    55
d    70   80    66

In [8]:
df.to_excel(r'scores.xlsx')

In [12]:
df2 = pd.read_excel(r'scores.xlsx', index_col='이름')

In [13]:
df2

    kor  eng  math
이름
a    10   20    33
b    30   40    44
c    50   60    55
d    70   80    66

In [23]:
def fn(v):
#     print("="*10)
#     print("v=\n", v)
    return v.sum()

In [24]:
df.apply(fn)                # column series

과목
kor     160
eng     200
math    198
dtype: int64

In [25]:
df.apply(fn, axis=1)          # row series

이름
a     63
b    114
c    165
d    216
dtype: int64

In [26]:
df.apply(fn)

과목
kor     160
eng     200
math    198
dtype: int64

In [29]:
df.apply(lambda v: v.sum())      # make row

과목
kor     160
eng     200
math    198
dtype: int64

In [30]:
df.apply(lambda v: v.sum(), axis=1)    # make column

이름
a     63
b    114
c    165
d    216
dtype: int64

In [32]:
df['결과'] = df.apply(lambda v: "합격" if v[0] > 50 else '불합격', axis=1)
df

과목  kor  eng  math   결과
이름
a    10   20    33  불합격
b    30   40    44  불합격
c    50   60    55  불합격
d    70   80    66   합격

In [36]:
df['kor결과'] = df['kor'].apply(lambda v: '합격' if v>=50 else '불합격')
df

과목  kor  eng  math   결과 kor결과
이름
a    10   20    33  불합격   불합격
b    30   40    44  불합격   불합격
c    50   60    55   합격    합격
d    70   80    66   합격    합격

In [38]:
df.drop(columns='결과', inplace=True)

In [39]:
df

과목  kor  eng  math kor결과
이름
a    10   20    33   불합격
b    30   40    44   불합격
c    50   60    55    합격
d    70   80    66    합격

In [44]:
df = get_dict_data_frame()
for n in df:
    print(n)
    
print()
print()
for n in df.items():
    print(n)

kor
eng
math


('kor', a    10
b    30
c    50
d    70
Name: kor, dtype: int64)
('eng', a    20
b    40
c    60
d    80
Name: eng, dtype: int64)
('math', a    33
b    44
c    55
d    66
Name: math, dtype: int64)

In [50]:
for i, sr in df.items():
#     print(i, sr['a'], sr['b'], sr['c'], sr['d'])
#     print(i, '\n', sr)
    print(i, '\t%(a)d\t%(b)d\t%(c)d\t%(d)d' % sr)

kor 	10	30	50	70
eng 	20	40	60	80
math 	33	44	55	66

In [51]:
for n in df.iteritems():     #for i, sr in df.items()
    print(n)

('kor', a    10
b    30
c    50
d    70
Name: kor, dtype: int64)
('eng', a    20
b    40
c    60
d    80
Name: eng, dtype: int64)
('math', a    33
b    44
c    55
d    66
Name: math, dtype: int64)

In [52]:
for n in df.iterrows():
    print(n)

('a', kor     10
eng     20
math    33
Name: a, dtype: int64)
('b', kor     30
eng     40
math    44
Name: b, dtype: int64)
('c', kor     50
eng     60
math    55
Name: c, dtype: int64)
('d', kor     70
eng     80
math    66
Name: d, dtype: int64)

In [53]:
for i, sr in df.iterrows():
    print(i, "%(kor)d %(eng)d %(math)d" % sr)

a 10 20 33
b 30 40 44
c 50 60 55
d 70 80 66